# Core (installed by bootstrap.sh)
brew "zoxide"
brew "fzf"
brew "zsh-syntax-highlighting"

# Optional extras — add your own below
brew "ripgrep"
brew "bat"
brew "jq"
brew "htop"
brew "tmux"

# macOS-only casks (GUI apps)
if OS.mac?
  cask "iterm2"
  cask "visual-studio-code"
  cask "sublime-text"
  cask "obsidian"
  cask "libreoffice"
  cask "commander-one"
  cask "google-chrome"
  cask "brave-browser"
  cask "firefox"
  cask "docker"
  cask "anaconda"
end
